Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/uart.c
  *prcr_reg() = k_rx_prcr_lock;
  return k_rx_ok;
}

/**
 * @brief Configure the GPIO and MPC pin-mux settings for a UART TX/RX pin pair
 *
 * @details
 * Prepares the two GPIO pins required for SCI UART operation by programming
 * the Multi-Function Pin Controller (MPC) and the Port Direction/Mode registers
 * in the correct order.  The RX72N hardware requires that:
 *  - MPC is configured before switching a pin to peripheral mode (PMR)
 *  - TX pin is driven as an output; RX pin is configured as an input
 *  - Both pins are switched to peripheral mode (PMR bit = 1) last
 *
 * **Algorithm steps:**
 * 1. Extract the port number and pin number from each rx_port_pin_t using
 *    rx_port_from_pin() and rx_pin_from_pin().
 * 2. Validate that both pin numbers are <= k_rx_pin_max (7); return
 *    k_rx_err_invalid_arg if out of range.  (Lower-bound check is omitted
 *    because pin numbers are uint8_t and k_rx_pin_min == 0, which would
 *    trigger -Wtype-limits.)
 * 3. Obtain volatile port register base pointers via rx_port_get_base(); return
 *    k_rx_err_invalid_arg if either is nullptr (invalid port number).
 * 4. Call rx_mpc_set_sci(tx_gpio) to set the TX pin's PFS register to the SCI
 *    TXD function; propagate any error immediately.
 * 5. Call rx_mpc_set_sci(rx_gpio) to set the RX pin's PFS register to the SCI
 *    RXD function; propagate any error immediately.
 * 6. Build per-pin bitmasks (k_uart_gpio_bit_set << pin_number).
 * 7. Set PDR bit for TX pin (output direction) and PMR bit for TX pin
 *    (peripheral mode).
 * 8. Clear PDR bit for RX pin (input direction) and set PMR bit for RX pin
 *    (peripheral mode).
 * 9. Return k_rx_ok.
 *
 * **MPC write protection:**
 * rx_mpc_set_sci() internally handles the PFSWE unlock/lock sequence, so this
 * function does not need to touch the PFSWE bit directly.
 *
 * **Pin direction and mode summary:**
 * | Pin | PDR (direction) | PMR (mode) |
 * |-----|-----------------|------------|
 * | TX  | 1 (output)      | 1 (peripheral) |
 * | RX  | 0 (input)       | 1 (peripheral) |
 *
 *
 *
 *
 * @pre tx_gpio and rx_gpio must correspond to physically valid RX72N port pins
 * @pre The SCI module clock must already be enabled (MSTP\\rB bit cleared) so
 *      that the SCI TXD/RXD MPC function codes are accepted
 *
 * @post TX pin: PDR bit set (output), PMR bit set (peripheral function)
 * @post RX pin: PDR bit cleared (input), PMR bit set (peripheral function)
 * @post Both pins' PFS registers configured for SCI TX/RX function via MPC
 *
 * @note Pin validation only checks upper bound (>k_rx_pin_max); lower bound
 *       (0) is omitted to avoid the -Wtype-limits compiler warning triggered by
 *       comparing an unsigned type to 0
 * @warning Passing the same pin for both TX and RX produces undefined hardware
 *          behaviour; no duplicate-pin check is performed
 *
 * @par Thread Safety:
 * Not thread-safe. PDR/PMR are read-modify-write targets shared with all GPIO
 * operations on the same port.  Call only during single-threaded initialization.
 *
 * @par Performance:
 * - Execution time: ~10 us (dominated by two rx_mpc_set_sci() calls)
 * - Stack usage: 32 bytes (four uint8_t locals + two pointer locals)
 *
 * @par Example:
 * @code{.c}
 * // Configure SCI9 default debug pins (PB7=TX, PB6=RX)
 * rx_err_t err = internal_configure_uart_pins(
 *   (rx_port_pin_t)k_uart_debug_tx_gpio,
 *   (rx_port_pin_t)k_uart_debug_rx_gpio);
 * if (err != k_rx_ok) {
 *   return err;  // Invalid pin specification or MPC error
 * }
 * @endcode
 *
 * @see uart_init_channel() Caller that passes validated tx_gpio/rx_gpio
 * @see rx_mpc_set_sci() MPC pin-function assignment (with PFSWE unlock)
 * @see rx_port_get_base() Port register base address lookup
 * @see uart_gpio_constants_t k_uart_gpio_bit_set used to build pin bitmasks
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_configure_uart_pins(const rx_port_pin_t tx_gpio, rx_port_pin_t rx_gpio)
{
  /* Extract port and pin numbers for hardware register access */
  const uint8_t tx_port = rx_port_from_pin(tx_gpio);
  const uint8_t tx_pin  = rx_pin_from_pin(tx_gpio);
  const uint8_t rx_port = rx_port_from_pin(rx_gpio);
  const uint8_t rx_pin  = rx_pin_from_pin(rx_gpio);

  /* Validate pin numbers (lower bound checks omitted - pins are uint8_t, k_rx_pin_min == 0,
   * so pin >= k_rx_pin_min is always true, avoiding -Wtype-limits warning) */
  if (tx_pin > k_rx_pin_max || rx_pin > k_rx_pin_max) {
    return k_rx_err_invalid_arg;
  }

  /* Get port bases */
  volatile rx_port_regs_t* tx_port_base = rx_port_get_base(tx_port);
  volatile rx_port_regs_t* rx_port_base = rx_port_get_base(rx_port);

  if (tx_port_base == nullptr || rx_port_base == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Configure MPC for SCI function */
  rx_err_t err = rx_mpc_set_sci(tx_gpio);
  if (err != k_rx_ok) {
    return err;
  }

  err = rx_mpc_set_sci(rx_gpio);
  if (err != k_rx_ok) {
    return err;
  }

  /* Configure TX pin: output direction, peripheral mode */
  const uint8_t tx_pin_mask = (uint8_t)(k_uart_gpio_bit_set << tx_pin);
  const uint8_t rx_pin_mask = (uint8_t)(k_uart_gpio_bit_set << rx_pin);

  tx_port_base->pdr |= tx_pin_mask; /* Output */
  tx_port_base->pmr |= tx_pin_mask; /* Peripheral mode */

  /* Configure RX pin: input direction, peripheral mode */
  rx_port_base->pdr &= (uint8_t)~rx_pin_mask; /* Input */
  rx_port_base->pmr |= rx_pin_mask;           /* Peripheral mode */

  return k_rx_ok;
}

/* =============================================================================
 * Multi-Channel UART Functions
 * =============================================================================
 */

/**
 * @brief Initialize UART channel with specified configuration
 *
 * @details
 * Configures and enables an SCI peripheral for asynchronous UART operation.
 * Handles module clock enable, pin mux configuration, and SCI register setup.
 *
 * **Algorithm steps:**
 * 1. Validate configuration parameters (NULL check, channel range, baud rate)
 * 2. Get SCI register base address for channel
 * 3. Check if channel is already initialized (prevent double-init)
 * 4. Enable SCI module clock (clear MSTPB bit)
 * 5. Configure TX/RX pins via MPC and GPIO registers
 * 6. Disable TX/RX during configuration (S\\r = 0)
 * 7. Set serial mode: async, 8N1, PCLK/1 (SMR)
 * 8. Calculate and set baud rate divisor (BRR)
 * 9. Wait for 1 bit time (synchronization)
 * 10. Enable TX and RX (S\\r = 0x30)
 * 11. Mark channel as initialized
 *
 * @dot
 * digraph uart_init {
 *   rankdir=TB;
 *   node [shape=box, style=rounded];
 *
 *   start [label="Start"];
 *   validate [label="Validate config"];
 *   check_init [label="Already initialized?", shape=diamond];
 *   enable_clk [label="Enable SCI clock"];
 *   config_pins [label="Configure TX/RX pins"];
 *   disable_txrx [label="Disable TX/RX"];
 *   set_mode [label="Set async 8N1 mode"];
 *   set_baud [label="Set BRR for baud rate"];
 *   wait [label="Wait 1 bit time"];
 *   enable_txrx [label="Enable TX + RX"];
 *   mark_init [label="Mark initialized"];
 *   success [label="Return k_rx_ok", fillcolor=lightgreen, style="rounded,filled"];
 *   error [label="Return error", fillcolor=lightcoral, style="rounded,filled"];
 *
 *   start -> validate;
 *   validate -> error [label="invalid"];
 *   validate -> check_init [label="valid"];
 *   check_init -> error [label="yes"];
 *   check_init -> enable_clk [label="no"];
 *   enable_clk -> config_pins;
 *   config_pins -> error [label="fail"];
 *   config_pins -> disable_txrx [label="ok"];
 *   disable_txrx -> set_mode;
 *   set_mode -> set_baud;
 *   set_baud -> wait;
 *   wait -> enable_txrx;
 *   enable_txrx -> mark_init;
 *   mark_init -> success;
 * }
 * @enddot
 *
 *
 *
 * @pre config must point to valid uart_channel_config_t structure
 * @pre config->channel must be in range [0, 12]
 * @pre config->baudrate must be in valid range for PCLKB
 * @pre Channel must not be already initialized
 *
 * @post Channel configured for 8N1 async operation
 * @post TX and RX enabled and ready for use
 * @post s_channel_initialized[channel] set to true
 * @post TX/RX pins configured for peripheral function
 *
 * @note Not thread-safe - call once during initialization
 * @note Includes ~1ms delay for baud rate synchronization
 * @warning Does not validate pin assignments against hardware
 *
 * @par Thread Safety:
 * Not thread-safe. Call once per channel during system initialization.
 *
 * @par Performance:
 * - Execution time: ~50 us (includes MPC and delay)
 * - Stack usage: 48 bytes
 *
 * @par Example:
 * @code{.c}
 * const uart_channel_config_t config = {
 *   .channel  = k_uart_channel_9,
 *   .baudrate = 115200,
 *   .tx_gpio  = k_rx_pb_7,
 *   .rx_gpio  = k_rx_pb_6,
 * };
 *
 * rx_err_t err = uart_init_channel(&config);
 * if (err != k_rx_ok) {
 *   // Handle error
 * }
 * @endcode
 *
 * @see uart_deinit_channel() Deinitialize channel
 * @see uart_putc_channel() Transmit single character
 * @see uart_channel_config_t Configuration structure
 *
 * @since Version 1.0.0
 */
rx_err_t uart_init_channel(const uart_channel_config_t* config)
{
  /* Validate config pointer */
  if (config == nullptr) {
    return k_rx_err_null_ptr;
  }

