Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/uart.c
  /* Validate channel */
  if ((uint8_t)config->channel >= k_uart_max_channels) {
    return k_rx_err_invalid_arg;
  }

  if ((config->baudrate < k_uart_baudrate_min) || (config->baudrate > k_uart_baudrate_max)) {
    return k_rx_err_invalid_arg;
  }

  /* Get SCI register base */
  volatile rx_sci_regs_t* sci = sci_get_channel(config->channel);
  if (sci == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Check if already initialized */
  if (s_channel_initialized[config->channel]) {
    return k_rx_err_invalid_state;
  }

  /* Enable SCI module clock (clear module stop bit) */
  rx_err_t err = internal_enable_sci_clock(config->channel);
  if (err != k_rx_ok) {
    return err;
  }

  /* Configure TX/RX pins (MPC and GPIO) */
  err = internal_configure_uart_pins(config->tx_gpio, config->rx_gpio);
  if (err != k_rx_ok) {
    return err;
  }

  /* Disable TX/RX */
  sci->scr = k_sci_scr_disabled;

  /* Configure serial mode: Async, 8-bit, no parity, 1 stop, PCLK/1 */
  sci->smr = k_sci_smr_async_8n1;

  /* Select the correct peripheral clock for this channel.
   * SCIj (SCI0-SCI6) and SCIh (SCI12) are clocked by PCLKB.
   * SCIi (SCI7-SCI11, extended region 0x000D0xxx) are clocked by PCLKA.
   * Using the wrong clock produces a wrong BRR and a wrong baud rate. */
  const uint32_t pclk_hz = (((uint8_t)config->channel >= k_uart_pclka_channel_min) &&
                            ((uint8_t)config->channel <= k_uart_pclka_channel_max))
                             ? k_pclka_hz
                             : k_pclkb_hz;

  /* SEMR.ABCS selects the base clock used by the bit-rate generator:
   * ABCS=0 -> 16 cycles/bit (default), ABCS=1 -> 8 cycles/bit (HUM 34.2.12).
   * For SCI9 @ 115200 baud the 16-cycle path only produces +1.72% baud
   * error on PCLKA=120 MHz, which causes a framing error (SSR.FER) on
   * every byte and prevents SSR.RDRF from ever latching -- so the RXI9
   * interrupt never fires and bytes never land in the ring. Switching
   * SCI9 to ABCS=1 halves the divisor, cuts the error to +0.16%, and
   * lets the receiver latch clean bytes. SEMR MUST be written before BRR
   * because BRR is interpreted against whatever base clock SEMR selects. */
  const bool use_abcs = (config->channel == k_uart_channel_9);
  sci->semr           = use_abcs ? (uint8_t)k_sci_semr_abcs_bit : (uint8_t)k_sci_semr_default;

  /* Set baud rate (uses the divisor selected by SEMR above) */
  sci->brr = internal_calculate_brr(config->baudrate, pclk_hz, use_abcs);

  /* Wait for at least 1 bit time */
  /* NOTE: Busy-wait required - may run before ThreadX initialization */
  for (volatile uint32_t i = 0; i < k_uart_bit_time_delay_cycles; i++) {
    __asm__ volatile("nop");
  }

  /* Configure serial control: Enable TX and RX */
  sci->scr = k_sci_scr_txrx_enabled;

  /* For SCI9, switch RX to interrupt-driven mode: reset the ring buffer,
   * set the RXI9 priority + IER bit + clear pending IR, then arm SCR.RIE.
   * HUM vector 102 = SCI9_RXI9, IER index 12 ((102>>3)=12), IER bit 6
   * ((102&7)=6). See comm_task RX overrun note at the top of this file. */
  if (config->channel == k_uart_channel_9) {
    s_sci9_rx_head = 0U;
    s_sci9_rx_tail = 0U;

    /* Drain any pending RDR byte and clear error flags BEFORE enabling the
     * RXI interrupt, so the first real byte doesn't find an ORER set from
     * boot-time noise (which would gate further interrupts). */
    if ((sci->ssr & k_sci_ssr_error_mask) != k_uart_flag_clear) {
      internal_clear_errors(sci);
    }
    if ((sci->ssr & k_sci_ssr_rdrf_flag) != k_uart_flag_clear) {
      (void)sci->rdr;
      const uint8_t ssr = sci->ssr;
      sci->ssr          = (uint8_t)(ssr & ~k_sci_ssr_rdrf_flag);
    }

    const uint16_t vec_rxi9 = (uint16_t)k_vect_sci9_rxi9;
    icu()->ipr[vec_rxi9]    = k_sci9_rxi9_priority;
    icu()->ir[vec_rxi9]     = 0U;
    icu()->ier[vec_rxi9 / k_icu_ier_bits_per_reg] |=
      (uint8_t)(1U << (vec_rxi9 % k_icu_ier_bits_per_reg));

    sci->scr = (uint8_t)(k_sci_scr_txrx_enabled | k_sci_scr_rie_bit);
  }

  /* Mark channel as initialized */
  s_channel_initialized[config->channel] = true;

  return k_rx_ok;
}

/**
 * @brief Deinitialize UART channel and disable TX/RX
 *
 * @details
 * Disables transmit and receive on the specified SCI channel and marks it
 * as uninitialized. The module clock is left running (safe to re-initialize
 * without re-enabling). After this call the channel may be re-initialized
 * with uart_init_channel().
 *
 * **Algorithm steps:**
 * 1. Validate channel number (0-12)
 * 2. Get SCI register base address
 * 3. Write S\\r = 0 to disable TX and RX
 * 4. Clear s_channel_initialized[channel]
 *
 *
 *
 * @pre channel must be in range [0, 12]
 * @pre Channel should be initialized before deinitializing (safe to call on uninit channel)
 *
 * @post TX and RX disabled (S\\r = 0)
 * @post s_channel_initialized[channel] set to false
 *
 * @note Not thread-safe - call during shutdown, not during normal operation
 * @note Module stop clock is NOT re-asserted (peripheral clock left enabled)
 *
 * @par Thread Safety:
 * Not thread-safe. Do not call while another thread is using the channel.
 *
 * @par Performance:
 * - Execution time: ~1 us
 * - Stack usage: 16 bytes
 *
 * @par Example:
 * @code{.c}
 * rx_err_t err = uart_deinit_channel(k_uart_channel_9);
 * if (err != k_rx_ok) {
 *   // Handle error (invalid channel)
 * }
 * // Channel is now disabled and can be re-initialized
 * @endcode
 *
 * @see uart_init_channel() Initialize channel
 * @see uart_debug_init() Initialize debug channel (SCI9)
 *
 * @since Version 1.0.0
 */
rx_err_t uart_deinit_channel(const uart_channel_t channel)
{
  /* Validate channel */
  if ((uint8_t)channel >= k_uart_max_channels) {
    return k_rx_err_invalid_arg;
  }

  /* Get SCI register base */
  volatile rx_sci_regs_t* sci = sci_get_channel(channel);
  if (sci == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Disable TX/RX (this also drops SCR.RIE for SCI9). */
  sci->scr = k_sci_scr_disabled;

  /* For SCI9, mask the RXI9 interrupt in the ICU and flush the ring so a
   * subsequent re-init starts clean. */
  if (channel == k_uart_channel_9) {
    const uint16_t vec_rxi9 = (uint16_t)k_vect_sci9_rxi9;
    icu()->ier[vec_rxi9 / k_icu_ier_bits_per_reg] &=
      (uint8_t) ~(1U << (vec_rxi9 % k_icu_ier_bits_per_reg));
    icu()->ir[vec_rxi9] = 0U;
    s_sci9_rx_head      = 0U;
    s_sci9_rx_tail      = 0U;
  }

